#==========================================================================================#
# >>>>> ПРИМЕЧАНИЯ <<<<< #
#==========================================================================================#
# При использовании MarkdownV2 следующие символы, не участвующие в разметке, должны быть экранированы:
# _ * [ ] ( ) ~ ` > # + - = | { } . ! →→→ \_ \* \[ \] \( \) \~ \` \> \# \+ \- \= \| \{ \} \. \!
# В тексте поста экранирование происходит автоматически до обработки пользовательским скриптом.
#==========================================================================================#
# Для обработки постов в зависимости от источника можно использовать условие с переменной Source, соответствующей его названию.
#==========================================================================================#

# Обрабатывает полученные из ВКонтакте посты пользовательским скриптом перед отправкой в Telegram. Если вернуть None, пост будет проигнорирован.
def MessageEditor(Post: str, Source: str) -> str | None:

	#==========================================================================================#
	# Поместите сюда код редактора постов.
	#==========================================================================================#
	
	return Post