#==========================================================================================#
# >>>>> ПРИМЕЧАНИЕ <<<<< #
#==========================================================================================#
# При использовании MarkdownV2 следующие символы, не участвующие в разметке, должны быть экранированы:
# _ * [ ] ( ) ~ ` > # + - = | { } . ! →→→ \_ \* \[ \] \( \) \~ \` \> \# \+ \- \= \| \{ \} \. \!
# В тексте поста экранирование происходит автоматически до обработки пользовательским скриптом.
#==========================================================================================#

# Обрабатывает полученные из ВКонтакте посты пользовательским скриптом перед отправкой в Telegram. Если вернуть None, пост будет проигнорирован.
def MessageEditor(Post: str) -> str | None:

	#==========================================================================================#
	# Поместите сюда код редактора постов.
	#==========================================================================================#

	return Post