from Source.Config import Config

class BaseEditor:
	"""Редактор постов."""

	#==========================================================================================#
	# >>>>> СВОЙСТВА <<<<< #
	#==========================================================================================#

	@property
	def config(self) -> Config:
		"""Конфигурация источника."""

		return self._Config
	
	@property
	def source(self) -> str:
		"""Название источника."""

		return self._Config.name

	#==========================================================================================#
	# >>>>> ПУБЛИЧНЫЕ МЕТОДЫ <<<<< #
	#==========================================================================================#

	def __init__(self, config: Config):
		"""
		Редактор постов.
			config – конфигурация источника.
		"""

		#---> Генерация динамических атрибутов.
		#==========================================================================================#
		self._Config = config

	def edit(self, text: str) -> str | None:
		"""
		Обрабатывает текст поста и возвращает отредактированную версию или ничего для игнорирования.
			text – текст поста.
		"""

		return text